content-org/teaching.org
#+TITLE: Teaching
#+TAGS: current past
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: teaching
#+FILETAGS: teaching
#+HUGO: more
#+SEQ_TODO: TODO NEXT DONE
#+HUGO_AUTO_SET_LASTMOD: t
#+hugo_front_matter_key_replace: description>summary

* Math 59                                                           :current:
:PROPERTIES:
:EXPORT_FILE_NAME: math59
:END:
** Book Links
*** Page 3
- [[https://youtu.be/gvQNybQO6E4?t=198][Abbott and Costello (start at 3:18) (YT)]]
- [[https://www.youtube.com/watch?v=H14bBuluwB8][Angela Duckworth Grit TED talk (YT)]]
- [[https://www.youtube.com/watch?v=Xs9aGVUZ3YA][Mathematigal - Math Major (YT)]]
*** Page 5
- [[https://youtu.be/3icoSeGqQtY][Jo Boaler - How you can be good at math (YT)]]
*** Page 19
- [[https://youtu.be/Je4rK9fMGKs][Interesting Numbers (1 to 50) (YT)]]
*** Page 20
- [[https://youtu.be/3YwrcJxEbZw][What Are Real Numbers? (YT)]]
- [[https://youtu.be/IueVrMlmQ2I][Real Numbers - Categories! (YT)]]
*** Page 35
- [[https://youtu.be/DKUZx1Nk4yY][Faberge Organics Commercial (YT)]]
- [[https://youtu.be/JA7CKvoKEmE][Wayne's World Parody of Faberge Organics Commercial (YT)]]
- [[http://www.thealmightyguru.com/Pointless/PowersOf2.html][Powers of 2]]
*** Page 36
- [[https://www.eamesoffice.com/education/powers-of-ten-2/][Powers of 10]]
*** Page 46
- [[https://youtu.be/XM1NNRNmZ6c][Pattern Finding (YT)]]
*** Page 72
- [[https://youtu.be/oYIHLUxzRr8][Hot Dogs vs Hot Dog Buns (YT)]]
*** Page 77
- [[https://youtu.be/XnEqfTjp66A][Are Prime Numbers Made Up? (YT)]]
- [[https://www.khanacademy.org/computing/computer-science/cryptography/comp-number-theory/v/sieve-of-eratosthenes-prime-adventure-part-4][Sieve of Eratosthenes]]
*** Page 78
- [[https://youtu.be/XnEqfTjp66A][Are Prime Nubmers Made Up?]]
*** Page 82
- [[https://www.khanacademy.org/computing/computer-science/cryptography/comp-number-theory/v/sieve-of-eratosthenes-prime-adventure-part-4][Sieve of Eratosthenes]]
*** Page 90
- [[https://www.consumerfinance.gov/][Consumer Finance Protection Bureau]]
*** Page 108
- [[http://www.globalwarmingequation.info/global%2520warming%2520eqn.pdf][Equation for Global Warming (PDF)]]
*** Page 119
- [[https://youtu.be/l3XzepN03KQ][Solving Equations Part 1 (YT)]]
- [[https://youtu.be/Qyd_v3DGzTM][Solving Equations Part 2 (YT)]]
- [[https://youtu.be/LDIiYKYvvdA][Solving 2-step equations (YT)]]
*** Page 121
- [[http://www.megsonline.net/lee_meg2.pdf][Growth Mindset (PDF)]]
- [[https://youtu.be/KUWn_TJTrnU][Growth Mindset vs. Fixed Mindset (YT)]]
- [[https://www.verywellfit.com/how-many-calories-does-running-burn-2911108][How Many Calories Does Running Burn?]]
*** Page 122
- [[https://www.runnersworld.com/training/a20801301/calories-burned-running-calculator/][Calorie Burn Calculator]]
*** Page 130
- [[https://youtu.be/52tpYl2tTqk][What Are Functions? (YT)]]
*** Page 132
- [[https://youtu.be/52tpYl2tTqk?t=340][What Are Functions? (YT)]]
*** Page 133
- [[https://youtu.be/52tpYl2tTqk?t=497][What Are Functions? (YT)]]
*** Page 154
- [[https://youtu.be/sE4eq0cjLFk]["A Function" Math Rap (YT)]]
*** Page 14

