content/teaching/math59.md
+++
title = "Math 59"
author = ["Christopher Godbout"]
lastmod = 2019-11-25T10:03:46-08:00
tags = ["teaching", "current"]
draft = false
+++

## Book Links {#book-links}


### Page 3 {#page-3}

-   [Abbott and Costello (start at 3:18) (YT)](https://youtu.be/gvQNybQO6E4?t=198)
-   [Angela Duckworth Grit TED talk (YT)](https://www.youtube.com/watch?v=H14bBuluwB8)
-   [Mathematigal - Math Major (YT)](https://www.youtube.com/watch?v=Xs9aGVUZ3YA)


### Page 5 {#page-5}

-   [Jo Boaler - How you can be good at math (YT)](https://youtu.be/3icoSeGqQtY)


### Page 19 {#page-19}

-   [Interesting Numbers (1 to 50) (YT)](https://youtu.be/Je4rK9fMGKs)


### Page 20 {#page-20}

-   [What Are Real Numbers? (YT)](https://youtu.be/3YwrcJxEbZw)
-   [Real Numbers - Categories! (YT)](https://youtu.be/IueVrMlmQ2I)


### Page 35 {#page-35}

-   [Faberge Organics Commercial (YT)](https://youtu.be/DKUZx1Nk4yY)
-   [Wayne's World Parody of Faberge Organics Commercial (YT)](https://youtu.be/JA7CKvoKEmE)
-   [Powers of 2](http://www.thealmightyguru.com/Pointless/PowersOf2.html)


### Page 36 {#page-36}

-   [Powers of 10](https://www.eamesoffice.com/education/powers-of-ten-2/)


### Page 46 {#page-46}

-   [Pattern Finding (YT)](https://youtu.be/XM1NNRNmZ6c)


### Page 72 {#page-72}

-   [Hot Dogs vs Hot Dog Buns (YT)](https://youtu.be/oYIHLUxzRr8)


### Page 77 {#page-77}

-   [Are Prime Numbers Made Up? (YT)](https://youtu.be/XnEqfTjp66A)
-   [Sieve of Eratosthenes](https://www.khanacademy.org/computing/computer-science/cryptography/comp-number-theory/v/sieve-of-eratosthenes-prime-adventure-part-4)


### Page 78 {#page-78}

-   [Are Prime Nubmers Made Up?](https://youtu.be/XnEqfTjp66A)


### Page 82 {#page-82}

-   [Sieve of Eratosthenes](https://www.khanacademy.org/computing/computer-science/cryptography/comp-number-theory/v/sieve-of-eratosthenes-prime-adventure-part-4)


### Page 90 {#page-90}

-   [Consumer Finance Protection Bureau](https://www.consumerfinance.gov/)


### Page 108 {#page-108}

-   [Equation for Global Warming (PDF)](http://www.globalwarmingequation.info/global warming eqn.pdf)


### Page 119 {#page-119}

-   [Solving Equations Part 1 (YT)](https://youtu.be/l3XzepN03KQ)
-   [Solving Equations Part 2 (YT)](https://youtu.be/Qyd%5Fv3DGzTM)
-   [Solving 2-step equations (YT)](https://youtu.be/LDIiYKYvvdA)


### Page 121 {#page-121}

-   [Growth Mindset (PDF)](http://www.megsonline.net/lee%5Fmeg2.pdf)
-   [Growth Mindset vs. Fixed Mindset (YT)](https://youtu.be/KUWn%5FTJTrnU)
-   [How Many Calories Does Running Burn?](https://www.verywellfit.com/how-many-calories-does-running-burn-2911108)


### Page 122 {#page-122}

-   [Calorie Burn Calculator](https://www.runnersworld.com/training/a20801301/calories-burned-running-calculator/)


### Page 130 {#page-130}

-   [What Are Functions? (YT)](https://youtu.be/52tpYl2tTqk)


### Page 132 {#page-132}

-   [What Are Functions? (YT)](https://youtu.be/52tpYl2tTqk?t=340)


### Page 133 {#page-133}

-   [What Are Functions? (YT)](https://youtu.be/52tpYl2tTqk?t=497)


### Page 154 {#page-154}

-   ["A Function" Math Rap (YT)](https://youtu.be/sE4eq0cjLFk)


### Page 14 {#page-14}
